constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


20
(
    GVINLET
    {
        type            patch;
        nFaces          100;
        startFace       10060;
        inGroups        1 ( inlet );
    }

    GVOUTLET
    {
        type            cyclicPeriodicAMI;
        nFaces          100;
        startFace       10160;
        inGroups        2 ( cyclicAMI upstreamRSIs );
        matchTolerance  0.01;
        transform       unknown;
        neighbourPatch  RUINLET;
        periodicPatch   RUCYCLIC1;
        AMIMethod       faceAreaWeightAMI;
        requireMatch    0;
        restartUncoveredSourceFace 1;
        maxIter         4;
    }

    GVCYCLIC1
    {
        type            cyclicAMI;
        nFaces          60;
        startFace       10260;
        inGroups        1 ( cyclicAMI );
        matchTolerance  0.0001;
        transform       rotational;
        rotationAxis    ( 0 0 1 );
        rotationCentre  ( 0 0 0 );
        rotationAngle   72;
        neighbourPatch  GVCYCLIC2;
        AMIMethod       faceAreaWeightAMI;
        restartUncoveredSourceFace 1;
    }

    GVCYCLIC2
    {
        type            cyclicAMI;
        nFaces          60;
        startFace       10320;
        inGroups        1 ( cyclicAMI );
        matchTolerance  0.0001;
        transform       rotational;
        rotationAxis    ( 0 0 1 );
        rotationCentre  ( 0 0 0 );
        rotationAngle   -72;
        neighbourPatch  GVCYCLIC1;
        AMIMethod       faceAreaWeightAMI;
        restartUncoveredSourceFace 1;
    }

    GVBLADE
    {
        type            wall;
        nFaces          200;
        startFace       10380;
        inGroups        1 ( blades );
        closedSolidBodyMotion false;
    }

    GVHUB
    {
        type            wall;
        nFaces          160;
        startFace       10580;
        inGroups        1 ( hub );
        closedSolidBodyMotion false;
    }

    GVSHROUD
    {
        type            wall;
        nFaces          160;
        startFace       10740;
        inGroups        1 ( shroud );
        closedSolidBodyMotion false;
    }

    RUINLET
    {
        type            cyclicPeriodicAMI;
        nFaces          100;
        startFace       10900;
        inGroups        2 ( cyclicAMI downstreamRSIs );
        matchTolerance  0.01;
        transform       unknown;
        neighbourPatch  GVOUTLET;
        periodicPatch   RUCYCLIC1;
        AMIMethod       faceAreaWeightAMI;
        requireMatch    0;
        restartUncoveredSourceFace 1;
        maxIter         4;
    }

    RUOUTLET
    {
        type            cyclicPeriodicAMI;
        nFaces          100;
        startFace       11000;
        inGroups        2 ( cyclicAMI upstreamRSIs );
        matchTolerance  0.01;
        transform       unknown;
        neighbourPatch  DTINLET;
        periodicPatch   RUCYCLIC1;
        AMIMethod       faceAreaWeightAMI;
        requireMatch    0;
        restartUncoveredSourceFace 1;
        maxIter         4;
    }

    RUCYCLIC1
    {
        type            cyclicAMI;
        nFaces          40;
        startFace       11100;
        inGroups        1 ( cyclicAMI );
        matchTolerance  0.0001;
        transform       rotational;
        neighbourPatch  RUCYCLIC2;
        rotationAxis    ( 0 0 1 );
        rotationCentre  ( 0 0 0 );
        rotationAngle   72;
        AMIMethod       faceAreaWeightAMI;
        restartUncoveredSourceFace 1;
    }

    RUCYCLIC2
    {
        type            cyclicAMI;
        nFaces          40;
        startFace       11140;
        inGroups        1 ( cyclicAMI );
        matchTolerance  0.0001;
        transform       rotational;
        neighbourPatch  RUCYCLIC1;
        rotationAxis    ( 0 0 1 );
        rotationCentre  ( 0 0 0 );
        rotationAngle   -72;
        AMIMethod       faceAreaWeightAMI;
        restartUncoveredSourceFace 1;
    }

    RUBLADE
    {
        type            wall;
        nFaces          200;
        startFace       11180;
        inGroups        1 ( blades );
        closedSolidBodyMotion false;
    }

    RUHUB
    {
        type            wall;
        nFaces          140;
        startFace       11380;
        inGroups        1 ( hub );
        closedSolidBodyMotion false;
    }

    RUSHROUD
    {
        type            wall;
        nFaces          140;
        startFace       11520;
        inGroups        1 ( shroud );
        closedSolidBodyMotion false;
    }

    DTINLET
    {
        type            cyclicPeriodicAMI;
        nFaces          100;
        startFace       11660;
        inGroups        2 ( cyclicAMI downstreamRSIs );
        matchTolerance  0.01;
        transform       unknown;
        neighbourPatch  RUOUTLET;
        periodicPatch   RUCYCLIC1;
        AMIMethod       faceAreaWeightAMI;
        requireMatch    0;
        restartUncoveredSourceFace 1;
        maxIter         4;
    }

    DTOUTLET
    {
        type            patch;
        nFaces          100;
        startFace       11760;
        inGroups        1 ( outlet );
    }

    DTCYCLIC1
    {
        type            cyclicAMI;
        nFaces          70;
        startFace       11860;
        inGroups        1 ( cyclicAMI );
        matchTolerance  0.0001;
        transform       rotational;
        neighbourPatch  DTCYCLIC2;
        rotationAxis    ( 0 0 1 );
        rotationCentre  ( 0 0 0 );
        rotationAngle   72;
        AMIMethod       faceAreaWeightAMI;
        restartUncoveredSourceFace 1;
    }

    DTCYCLIC2
    {
        type            cyclicAMI;
        nFaces          70;
        startFace       11930;
        inGroups        1 ( cyclicAMI );
        matchTolerance  0.0001;
        transform       rotational;
        neighbourPatch  DTCYCLIC1;
        rotationAxis    ( 0 0 1 );
        rotationCentre  ( 0 0 0 );
        rotationAngle   -72;
        AMIMethod       faceAreaWeightAMI;
        restartUncoveredSourceFace 1;
    }

    DTHUB
    {
        type            wall;
        nFaces          70;
        startFace       12000;
        inGroups        1 ( hub );
        closedSolidBodyMotion false;
    }

    DTSHROUD
    {
        type            wall;
        nFaces          70;
        startFace       12070;
        inGroups        1 ( shroud );
        closedSolidBodyMotion false;
    }

)


// ************************************************************************* //
