system/functionObjects/funcObjSwirlNumber
// C++
#include "funcObjComponents" // To calculate Uz (needed for flux)
#include "funcObjDerivedFields" // To calculate rhoU (needed for flux)
#include "funcObjCylVel" // To calculate angular velocity
#include "funcObjTangentialMomentum" // To calculate moment of momentum
#include "funcObjTangentialMomentumFlux" // To calculate the integrals in the numerator and denominator of the swirl number